https://Daniellem97.app.spacelift.io/stack/dependencies-test/run/01JVCMW7PCRZQD331WKVA6XV5N has finished

## Planning logs

```
[01JV9E8QZF20369HFFAP7ESWZA] Planning changes with 0 custom hooks...
spacelift_stack.stack-a: Refreshing state... [id=dependencies-stack-a]
spacelift_stack.stack-b: Refreshing state... [id=dependencies-stack-b]
spacelift_stack_dependency.dependency: Refreshing state... [id=dependencies-stack-b/01JF80HDMNGEJXQH84WD92XFVE]
spacelift_stack_dependency_reference.reference: Refreshing state... [id=dependencies-stack-b/01JF80HDMNGEJXQH84WD92XFVE/01JF80HDWB3CY1ZJVQ41NP4HVN]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # spacelift_stack_dependency.dependency has been deleted
  - resource "spacelift_stack_dependency" "dependency" {
      - id                  = "dependencies-stack-b/01JF80HDMNGEJXQH84WD92XFVE" -> null
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # spacelift_stack.stack-1 will be created
  + resource "spacelift_stack" "stack-1" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + enable_local_preview             = false
      + enable_sensitive_outputs_upload  = true
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "Dependencies stack 1"
      + project_root                     = "stack-a"
      + protect_from_deletion            = false
      + repository                       = "stack-dependencies-test"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)
    }

  # spacelift_stack.stack-2 will be created
  + resource "spacelift_stack" "stack-2" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + description                      = "Your first stack managed by Terraform"
      + enable_local_preview             = false
      + enable_sensitive_outputs_upload  = true
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "Dependencies stack 2"
      + project_root                     = "stack-b"
      + protect_from_deletion            = false
      + repository                       = "stack-dependencies-test"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)
    }

  # spacelift_stack.stack-3 will be created
  + resource "spacelift_stack" "stack-3" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + description                      = "Your first stack managed by Terraform"
      + enable_local_preview             = false
      + enable_sensitive_outputs_upload  = true
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "Dependencies stack 3"
      + project_root                     = "stack-c"
      + protect_from_deletion            = false
      + repository                       = "stack-dependencies-test"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)
    }

  # spacelift_stack_dependency.dependency will be created
  + resource "spacelift_stack_dependency" "dependency" {
      + depends_on_stack_id = (known after apply)
      + id                  = (known after apply)
      + stack_id            = (known after apply)
    }

  # spacelift_stack_dependency_reference.reference will be created
  + resource "spacelift_stack_dependency_reference" "reference" {
      + id                  = (known after apply)
      + input_name          = "TF_VAR_APP_DB_URL"
      + output_name         = "DB_CONNECTION_STRING"
      + stack_dependency_id = (known after apply)
      + trigger_always      = false
    }

Plan: 5 to add, 0 to change, 0 to destroy.
╷
│ Warning: could not find stack (dependencies-stack-b), maybe it was deleted manually
│ 
│   with spacelift_stack_dependency_reference.reference,
│   on main.tf line 29, in resource "spacelift_stack_dependency_reference" "reference":
│   29: resource "spacelift_stack_dependency_reference" "reference" {
│ 
╵
[01JV9E8QZF20369HFFAP7ESWZA] Changes are GO
Failed to marshal state to json: schema version 0 for spacelift_stack.stack-a in state does not match version 1 from the provider
[01JV9E8QZF20369HFFAP7ESWZA] unexpected exit code when running show command: 1
[01JV9E8QZF20369HFFAP7ESWZA] Uploading the list of managed resources...
[01JV9E8QZF20369HFFAP7ESWZA] Please be aware that the run changes calculation includes output changes.
[01JV9E8QZF20369HFFAP7ESWZA] Resource list upload is GO
[01JV9E8QZF20369HFFAP7ESWZA] Generating JSON representation of the plan...
[01JV9E8QZF20369HFFAP7ESWZA] JSON representation is GO
[01JV9E8QZF20369HFFAP7ESWZA] Loading custom plan policy inputs...
[01JV9E8QZF20369HFFAP7ESWZA] 0 custom plan policy inputs found
[01JV9E8QZF20369HFFAP7ESWZA] No plan policies to evaluate
```
